# Cypher Syntax
- Nodes - Represented with parentheses around the corresponding attributes and information
	- In Bloodhound, Nodes can represent a user, a group, a computer, or a domain in Active Directory.
- Relationships - Depicted by dashes and arrows, with the relationship type in brackets. These show the direction of the relationship
	- In Bloodhound, Relationships between nodes are shown using edges.

# Basic Cypher Query
Each variable is defined using a single letter or an entire word. Here the variable identifiers are `A,B,C`. As discussed prior, `A` and `C` are nodes, while the `B` in brackets is the relationship between the two nodes. The above example looks for relationships that go from A to C, and the `RETURN` statement tells the database to return all items that match the specified variable names.
```sql
MATCH (A)-[B]->(C) RETURN A,B,C
```

# Cypher keywords
| Key | Description |
| --- | ----------- |
| `MATCH` | Used before describing the search pattern for finding one or more nodes or relationships.|
| `WHERE` | Used to add more constraints to specific patterns or filter out unwanted patterns. |
| `RETURN` | Used to specify the results format and organizes the resulting data. Results can be returned with specific properties | lists, ordering, etc.


# Most used Edges
| Edge | Description |
| ----- | ------------ |
| `MemberOf`  | One node (user, group, or computer) is a member of a second node (group) |
| `AdminTo` | One node (user, group, or computer) has local admin rights on a second node (computer) |
| `HasSession` | One node (user) has a session on a second node (computer) |
| `TrustedBy` | One node (domain) is trusted by a second node (domain) |

More details can be found here :
- https://bloodhound.readthedocs.io/en/latest/data-analysis/edges.html

# Examples 
Here we assign the variables `n` and `m` to User and Group, respectively, and tell `BloodHound` to find matching nodes using the `MemberOf` relationship (or edge). The `*1..3` tells `Bloodhound` to limit the search to returning members of a group up to three links away. The result is assigned to the variable `p` and will return the result of each path that matches the pattern we specified.
```sql
MATCH (n:User),(m:Group) MATCH p=(n)-[r:MemberOf*1..3]->(m) RETURN p
```


# List of custom queries and the related JSON file
### Github repository
- https://github.com/hausec/Bloodhound-Custom-Queries

### Cheatsheet
- https://hausec.com/2019/09/09/bloodhound-cypher-cheatsheet/

# Explanation of the < - sign
```sql
MATCH (c:Computer), (u:User {name: 'PIXIS@INLANEFREIGHT.LOCAL'}), p=(u)<-[HasSession]-(c) return p
```

![[Pasted image 20210916145025.png]]
